[
    {
      "title": "Sweden-Brazil Defense Deal",
      "description": "Sweden’s Saab AB has signed a major agreement with Brazil to provide JAS Gripen fighter jets and military transport planes.",
      "link": "#",
      "category": "Military",
      "date": "2024-03-08",
      "dealValue": "$5 Billion",
      "industry": "Defense and Aerospace",
      "buyer": "Brazilian Air Force",
      "seller": "Saab AB (<span class=\"stock-symbol\">SAAB-B</span>)",
      "impact": "This strategic partnership focuses on delivering 36 Gripen NG fighter jets to the Brazilian Air Force, transferring advanced technology, and establishing local production to bolster Brazil’s defense sector.",
      "subcontractors": [
        "Embraer S.A. (<span class=\"stock-symbol\">NYSE: ERJ</span>): Local assembly, production, and aircraft testing.",
        "AEL Sistemas (Private): Avionics systems integration and development.",
        "GE Aviation (General Electric, <span class=\"stock-symbol\">NYSE: GE</span>): Engines (F414-GE-396) for the Gripen NG aircraft.",
        "Saab Aerostructures (Part of Saab AB, <span class=\"stock-symbol\">SAAB-B</span>): Design and production of structural components.",
        "Akaer Engenharia (Private): Structural engineering and fuselage components."
      ]
    },
    {
      "title": "Wallstreet AI Investments",
      "description": "Wall Street firms are collectively investing trillions in AI-related infrastructure such as data centers, energy grids, and communication networks.",
      "link": "#",
      "category": "Finance",
      "date": "2024-03-09",
      "dealValue": "Trillions of USD",
      "industry": "Finance and Technology",
      "buyer": "Various Wall Street Firms",
      "seller": "Technology Providers, Energy Companies, Telecoms",
      "impact": "Significant expansion of AI infrastructure, potential for new technological advancements and economic growth.",
      "subcontractors": []
    },
    {
      "title": "UK Nuclear Power Plant Financing Agreement",
      "description": "The UK government has agreed to provide financial support for the development of the Sizewell C nuclear power plant, involving EDF and other partners.",
      "link": "https://www.gov.uk/government/news/sizewell-c-nuclear-project-receives-government-backing",
      "category": "Energy",
      "date": "2025-03-27",
      "dealValue": "£5.5 Billion",
      "industry": "Nuclear Energy",
      "buyer": "UK Government",
      "seller": "EDF Energy (<span class=\"stock-symbol\">EDF.PA</span>)",
      "impact": "Supports the UK’s transition to low-carbon energy and enhances energy security with clean nuclear power.",
      "subcontractors": [
        "Rolls-Royce Holdings plc (<span class=\"stock-symbol\">RR.L</span>): Potential supplier for nuclear components."
      ]
    },
    {
      "title": "US Navy F/A-18 Block III Super Hornet Upgrade Program",
      "description": "Boeing has been awarded a contract by the US Navy to upgrade and deliver F/A-18 Block III Super Hornet aircraft, involving advanced systems integration and sustainment services. The deal includes multiple partners and subcontractors for avionics, sensors, and logistics support.",
      "link": "https://www.boeing.com/defense/fa-18-super-hornet/",
      "category": "Military",
      "date": "2024-09-15",
      "dealValue": "$1.3 Billion",
      "industry": "Aerospace and Defense",
      "buyer": "US Navy",
      "seller": "The Boeing Company (<span class=\"stock-symbol\">NYSE: BA</span>)",
      "impact": "Enhances the US Navy's air combat capabilities with upgraded multi-role fighters, improving operational readiness and technological superiority.",
      "subcontractors": [
        "Northrop Grumman Corporation (<span class=\"stock-symbol\">NYSE: NOC</span>): Provides advanced radar systems and electronic warfare suites.",
        "Raytheon Technologies Corporation (<span class=\"stock-symbol\">NYSE: RTX</span>): Supplies avionics and sensor integration."
      ]
    }

  ]
  